# PathOfTravelSpeed Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..PathOfTravelSpeed Property
ParameterTypeId Class See Also
---
"Speed"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId PathOfTravelSpeed { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property PathOfTravelSpeed As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ PathOfTravelSpeed {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace